dj-zhou/one-third-hal-stm32/one-third-hal/core/general-utils.c
#include "general-utils.h"

// ============================================================================
#if defined(RTOS_IS_USED)
static RtosState_e rtos_state_;
#endif

// ============================================================================
// clang-format off
#if defined(_LED_HEARTBEAT_PORT)
    #define ERROR_LED_PORT _LED_HEARTBEAT_PORT
#else
    #define ERROR_LED_PORT GPIOA  // not sure if this will conflict with something
#endif
#if defined(_LED_HEARTBEAT_PIN)
    #define ERROR_LED_PIN _LED_HEARTBEAT_PIN
#else
    #define ERROR_LED_PIN 5  // not sure if this will conflict with something
#endif
// clang-format on

// ============================================================================
static void Error_Handler(uint32_t hclk) {
    int step;
    if (hclk < 10000000) {
        step = 10;
    }
    else if (hclk < 20000000) {
        step = 20;
    }
    else if (hclk < 50000000) {
        step = 50;
    }
    else if (hclk < 100000000) {
        step = 100;
    }
    else if (hclk < 200000000) {
        step = 2000;
    }
    else if (hclk < 300000000) {
        step = 5000;
    }
    else if (hclk < 400000000) {
        step = 6000;
    }
    else if (hclk < 500000000) {
        step = 6600;
    }
    else {
        step = 10000;
    }

    utils.pin.mode(ERROR_LED_PORT, ERROR_LED_PIN, GPIO_MODE_OUTPUT_PP);
    while (1) {
        for (int i = 0; i < step; i++) {
            for (int j = 0; j < 500; j++) {
                ;
            }
        }
        utils.pin.toggle(ERROR_LED_PORT, ERROR_LED_PIN);
    }
}

// ============================================================================
#if defined(SYSTEM_CLOCK_HAS_APB1)
static HAL_StatusTypeDef VerifyClocks(uint32_t hclk, uint32_t pclk1) {
    uint32_t hclk_ = HAL_RCC_GetHCLKFreq();
    uint32_t pclk1_ = HAL_RCC_GetPCLK1Freq();

    if ((hclk_ != hclk) || (pclk1_ != pclk1)) {
        Error_Handler(hclk);
    }
    return HAL_OK;
}
#endif  // SYSTEM_CLOCK_HAS_APB1

#if defined(SYSTEM_CLOCK_HAS_APB12)
static HAL_StatusTypeDef VerifyClocks(uint32_t hclk, uint32_t pclk1,
                                      uint32_t pclk2) {
    uint32_t hclk_ = HAL_RCC_GetHCLKFreq();
    uint32_t pclk1_ = HAL_RCC_GetPCLK1Freq();
    uint32_t pclk2_ = HAL_RCC_GetPCLK2Freq();
    // no addclk?
    if ((hclk_ != hclk) || (pclk1_ != pclk1) || (pclk2_ != pclk2)) {
        Error_Handler(hclk);
    }
    return HAL_OK;
}
#endif  // SYSTEM_CLOCK_HAS_APB12

#if defined(SYSTEM_CLOCK_HAS_APB1234)
static HAL_StatusTypeDef VerifyClocks(uint32_t hclk, uint32_t pclk1,
                                      uint32_t pclk2, uint32_t pclk3,
                                      uint32_t pclk4) {
    uint32_t hclk_ = HAL_RCC_GetHCLKFreq();
    uint32_t pclk1_ = HAL_RCC_GetPCLK1Freq();
    uint32_t pclk2_ = HAL_RCC_GetPCLK2Freq();
    uint32_t pclk3_ = HAL_RCC_GetPCLK3Freq();
    uint32_t pclk4_ = HAL_RCC_GetPCLK4Freq();

    // no addclk?
    if ((hclk_ != hclk) || (pclk1_ != pclk1) || (pclk2_ != pclk2)
        || (pclk3_ != pclk3) || (pclk4_ != pclk4)) {
        Error_Handler(hclk);
    }
    return HAL_OK;
}
#endif  // SYSTEM_CLOCK_HAS_APB1234

// ============================================================================
#if defined(STM32F030x8)
static HAL_StatusTypeDef InitClock_F030x8(uint16_t hclk_m, uint16_t pclk1_m) {
    if ((hclk_m != 48) || (pclk1_m != 48)) {
        Error_Handler(hclk_m * 5000000);
    }
    if (HSE_VALUE == 8000000) {
        RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
        RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
        RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
        RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL6;
        RCC_OscInitStruct.PLL.PREDIV = RCC_PREDIV_DIV1;
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }

        RCC_ClkInitStruct.ClockType =
            RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
        RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
        RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
        RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

        if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1)
            != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }
    }
    else {
        // #error not supported.
    }
    return VerifyClocks(48000000, 48000000);
}
#endif  // STM32F030x8

// ============================================================================
#if defined(STM32F103xB)
static HAL_StatusTypeDef InitClock_F103xB(uint16_t hclk_m, uint16_t pclk1_m,
                                          uint16_t pclk2_m) {
    if ((hclk_m != 72) || (pclk1_m != 36) || (pclk2_m != 72)) {
        Error_Handler(hclk_m * 5000000);
    }
    if (HSE_VALUE == 8000000) {
        RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
        RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
        RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
        RCC_OscInitStruct.HSIState = RCC_HSI_ON;
        RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
        RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }

        RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                      | RCC_CLOCKTYPE_PCLK1
                                      | RCC_CLOCKTYPE_PCLK2;
        RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
        RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
        RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
        RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

        if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2)
            != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }
    }
    else {
        // #error not supported.
    }
    return VerifyClocks(72000000, 36000000, 72000000);
}
#endif  // STM32F103xB

// ============================================================================
#if defined(STM32F107xC)
static HAL_StatusTypeDef InitClock_F107xC(uint16_t hclk_m, uint16_t pclk1_m,
                                          uint16_t pclk2_m) {
    if ((hclk_m != 72) || (pclk1_m != 36) || (pclk2_m != 72)) {
        Error_Handler(hclk_m * 5000000);
    }
    if (HSE_VALUE == 25000000) {
        RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
        RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

        // 25Mhz / 5 * 8 / 5 * 9 = 72 Mhz
        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
        RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV5;
        RCC_OscInitStruct.HSIState = RCC_HSI_ON;
        RCC_OscInitStruct.Prediv1Source = RCC_PREDIV1_SOURCE_PLL2;
        RCC_OscInitStruct.PLL2.PLL2State = RCC_PLL2_ON;
        RCC_OscInitStruct.PLL2.PLL2MUL = RCC_PLL2_MUL8;
        RCC_OscInitStruct.PLL2.HSEPrediv2Value = RCC_HSE_PREDIV2_DIV5;
        RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
        RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }

