dj-zhou/one-third-hal-stm32/one-third-hal/core/general-utils.c
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                  | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        Error_Handler(HSE_VALUE * 5);
    }

    if (HAL_PWREx_EnableOverDrive() != HAL_OK) {
        Error_Handler(HSE_VALUE * 5);
    }

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
        Error_Handler(HSE_VALUE * 5);
    }
    return VerifyClocks(hclk, pclk1, pclk2);
}
#endif  // STM32F427xx

// ============================================================================
#if defined(STM32F746xx) || defined(STM32F767xx)
static HAL_StatusTypeDef InitClock_F7xxxx(uint16_t hclk_m, uint16_t pclk1_m,
                                          uint16_t pclk2_m) {
    if ((hclk_m != 216) || (pclk1_m != 54) || (pclk2_m != 108)) {
        Error_Handler(hclk_m * 5000000);
    }
    if (HSE_VALUE == 8000000) {
        RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
        RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

        __HAL_RCC_PWR_CLK_ENABLE();
        __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
        RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
        RCC_OscInitStruct.PLL.PLLM = 8;
        RCC_OscInitStruct.PLL.PLLN = 432;
        RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
        RCC_OscInitStruct.PLL.PLLQ = 2;
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }

        if (HAL_PWREx_EnableOverDrive() != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }

        RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                      | RCC_CLOCKTYPE_PCLK1
                                      | RCC_CLOCKTYPE_PCLK2;
        RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
        RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
        RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
        RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

        if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7)
            != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }
    }
    else {
        // #error not supported.
    }

    return VerifyClocks(216000000, 54000000, 108000000);
}
#endif  // STM32F746xx || STM32F767xx

// ============================================================================
#if defined(STM32H750xx)
static HAL_StatusTypeDef InitClock_H750xx(uint16_t hclk_m, uint16_t pclk1_m,
                                          uint16_t pclk2_m, uint16_t pclk3_m,
                                          uint16_t pclk4_m) {
    if ((hclk_m != 480) || (pclk1_m != 120) || (pclk2_m != 120)
        || (pclk3_m != 120) || (pclk4_m != 120)) {
        Error_Handler(hclk_m * 5000000);
    }
    if (HSE_VALUE == 25000000) {
        RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
        RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

        HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);
        __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

        while (!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {
        }

        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
        RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
        RCC_OscInitStruct.PLL.PLLM = 5;
        RCC_OscInitStruct.PLL.PLLN = 192;
        RCC_OscInitStruct.PLL.PLLP = 2;
        RCC_OscInitStruct.PLL.PLLQ = 2;
        RCC_OscInitStruct.PLL.PLLR = 2;
        RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_2;
        RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
        RCC_OscInitStruct.PLL.PLLFRACN = 0;
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }
        /** Initializes the CPU, AHB and APB buses clocks
         */
        RCC_ClkInitStruct.ClockType =
            RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1
            | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_D3PCLK1
            | RCC_CLOCKTYPE_D1PCLK1;
        RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
        RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
        RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
        RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
        RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
        RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
        RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

        if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4)
            != HAL_OK) {
            Error_Handler(HSE_VALUE * 5);
        }
    }
    else {
        // #error not supported.
    }

    return VerifyClocks(480000000, 120000000, 120000000, 120000000, 120000000);
}
#endif  // STM32H750xx

// ============================================================================
// ============================================================================
#if defined(SYSTEM_CLOCK_HAS_APB1)
static HAL_StatusTypeDef InitSystemClock(uint16_t hclk_m, uint16_t pclk1_m) {
#if defined(STM32F030x8)
    InitClock_F030x8(hclk_m, pclk1_m);
#else
#error InitSystemClock(): to implement and verify!
#endif
    // it will call HAL_MspInit() in stm32f1xx_hal_msp.c
    // thte HAL_MspInit() initialized the SysTick to 1K Hz frequency
    // however, our stime.config() will override it.
    HAL_Init();
    return HAL_OK;
}
#endif  // SYSTEM_CLOCK_HAS_APB1

#if defined(SYSTEM_CLOCK_HAS_APB12)
static HAL_StatusTypeDef InitSystemClock(uint16_t hclk_m, uint16_t pclk1_m,
                                         uint16_t pclk2_m) {
#if defined(STM32F103xB)
    InitClock_F103xB(hclk_m, pclk1_m, pclk2_m);
#elif defined(STM32F107xC)
    InitClock_F107xC(hclk_m, pclk1_m, pclk2_m);
#elif defined(STM32F303xE)
    InitClock_F303xE(hclk_m, pclk1_m, pclk2_m);
#elif defined(STM32F407xx)
    InitClock_F407xx(hclk_m, pclk1_m, pclk2_m);
#elif defined(STM32F427xx)
    InitClock_F427xx(hclk_m, pclk1_m, pclk2_m);
#elif defined(STM32F746xx)
    InitClock_F7xxxx(hclk_m, pclk1_m, pclk2_m);
#elif defined(STM32F767xx)
    InitClock_F7xxxx(hclk_m, pclk1_m, pclk2_m);
#else
#error InitSystemClock(): to implement and verify!
#endif
    // it will call HAL_MspInit() in stm32f1xx_hal_msp.c
    // thte HAL_MspInit() initialized the SysTick to 1K Hz frequency
    // however, our stime.config() will override it.
    HAL_Init();
    return HAL_OK;
}
#endif  // SYSTEM_CLOCK_HAS_APB12

#if defined(SYSTEM_CLOCK_HAS_APB1234)
static HAL_StatusTypeDef InitSystemClock(uint16_t hclk_m, uint16_t pclk1_m,
                                         uint16_t pclk2_m, uint16_t pclk3_m,
                                         uint16_t pclk4_m) {
#if defined(STM32H750xx)
    InitClock_H750xx(hclk_m, pclk1_m, pclk2_m, pclk3_m, pclk3_m);
#else
#error InitSystemClock(): to implement and verify!
#endif
    // it will call HAL_MspInit() in stm32f1xx_hal_msp.c
    // thte HAL_MspInit() initialized the SysTick to 1K Hz frequency
    // however, our stime.config() will override it.
    HAL_Init();
    return HAL_OK;
}
#endif  // SYSTEM_CLOCK_HAS_APB1234

// ============================================================================
static void InitNvicInterrupt(uint8_t group) {
#if defined(STM32F030x8)
    // seems no grouping for Cortex M0
    ( void )group;
    return;
#else
    switch (group) {
    case 0:
        HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_0);
        break;
    case 1:
        HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_1);
        break;
    case 2:
        HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_2);
        break;
    case 3:
        HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_3);
        break;
    case 4:
    default:
        HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
        break;
    }
#endif
}

// ============================================================================
#if defined(CAN_EXISTS)
static void enableCanClock(CAN_TypeDef* CANx) {
// clang-format off
#if defined(CAN1_EXISTS)
    if (CANx == CAN1) { __HAL_RCC_CAN1_CLK_ENABLE(); return; }
#endif
#if defined(CAN2_EXISTS)
    if (CANx == CAN2) { __HAL_RCC_CAN2_CLK_ENABLE(); return; }
#endif
#if defined(CAN3_EXISTS)
    if (CANx == CAN3) { __HAL_RCC_CAN3_CLK_ENABLE(); return; }
#endif
    // clang-format on
    ( void )CANx;
}
#endif  // CAN_EXISTS

// ============================================================================
static void enableGpioClock(GPIO_TypeDef* GPIOx) {
// clang-format off
#if defined(GPIOA_EXISTS)
    if (GPIOx == GPIOA) { __HAL_RCC_GPIOA_CLK_ENABLE(); return; }
#endif
#if defined(GPIOB_EXISTS)
    if (GPIOx == GPIOB) { __HAL_RCC_GPIOB_CLK_ENABLE(); return; }
#endif
#if defined(GPIOC_EXISTS)
    if (GPIOx == GPIOC) { __HAL_RCC_GPIOC_CLK_ENABLE(); return; }
#endif
#if defined(GPIOD_EXISTS)
    if (GPIOx == GPIOD) { __HAL_RCC_GPIOD_CLK_ENABLE(); return; }
#endif
#if defined(GPIOE_EXISTS)
    if (GPIOx == GPIOE) { __HAL_RCC_GPIOE_CLK_ENABLE(); return; }
#endif
#if defined(GPIOF_EXISTS)
    if (GPIOx == GPIOF) { __HAL_RCC_GPIOF_CLK_ENABLE(); return; }
#endif
#if defined(GPIOG_EXISTS)
    if (GPIOx == GPIOG) { __HAL_RCC_GPIOG_CLK_ENABLE(); return; }
#endif
#if defined(GPIOH_EXISTS)
    if (GPIOx == GPIOH) { __HAL_RCC_GPIOH_CLK_ENABLE(); return; }
#endif
#if defined(GPIOI_EXISTS)
    if (GPIOx == GPIOI) { __HAL_RCC_GPIOI_CLK_ENABLE(); return; }
#endif
#if defined(GPIOJ_EXISTS)
    if (GPIOx == GPIOJ) { __HAL_RCC_GPIOJ_CLK_ENABLE(); return; }
#endif
#if defined(GPIOK_EXISTS)
    if (GPIOx == GPIOK) { __HAL_RCC_GPIOK_CLK_ENABLE(); return; }
#endif
    // clang-format on
    ( void )GPIOx;
}

// ============================================================================
#if defined(IIC_EXISTS)
static void enableIicClock(I2C_TypeDef* IICx) {
// clang-format off
#if defined(IIC1_EXISTS)
    if (IICx == I2C1) { __HAL_RCC_I2C1_CLK_ENABLE(); return; }
#endif
#if defined(IIC2_EXISTS)
    if (IICx == I2C2) { __HAL_RCC_I2C2_CLK_ENABLE(); return; }
#endif
#if defined(IIC3_EXISTS)
    if (IICx == I2C3) { __HAL_RCC_I2C3_CLK_ENABLE(); return; }
#endif
#if defined(IIC4_EXISTS)
    if (IICx == I2C4) { __HAL_RCC_I2C4_CLK_ENABLE(); return; }
#endif
    // clang-format on
    ( void )IICx;
}
#endif  // IIC_EXISTS

// ============================================================================
static void enableTimerClock(TIM_TypeDef* TIMx) {
// clang-format off
#if defined(TIM1_EXISTS)
    if (TIMx == TIM1) { __HAL_RCC_TIM1_CLK_ENABLE(); return; }
#endif
#if defined(TIM2_EXISTS)
    if (TIMx == TIM2) { __HAL_RCC_TIM2_CLK_ENABLE(); return; }
#endif
#if defined(TIM3_EXISTS)
    if (TIMx == TIM3) { __HAL_RCC_TIM3_CLK_ENABLE(); return; }
#endif
#if defined(TIM4_EXISTS)
    if (TIMx == TIM4) { __HAL_RCC_TIM4_CLK_ENABLE(); return; }
#endif
#if defined(TIM5_EXISTS)
    if (TIMx == TIM5) { __HAL_RCC_TIM5_CLK_ENABLE(); return; }
#endif
#if defined(TIM6_EXISTS)
    if (TIMx == TIM6) { __HAL_RCC_TIM6_CLK_ENABLE(); return; }
#endif
#if defined(TIM7_EXISTS)
    if (TIMx == TIM7) { __HAL_RCC_TIM7_CLK_ENABLE(); return; }
#endif
#if defined(TIM8_EXISTS)
    if (TIMx == TIM8) { __HAL_RCC_TIM8_CLK_ENABLE(); return; }
#endif
#if defined(TIM9_EXISTS)
    if (TIMx == TIM9) { __HAL_RCC_TIM9_CLK_ENABLE(); return; }
#endif
#if defined(TIM10_EXISTS)
    if (TIMx == TIM10) { __HAL_RCC_TIM10_CLK_ENABLE(); return; }
#endif
#if defined(TIM11_EXISTS)
    if (TIMx == TIM11) { __HAL_RCC_TIM11_CLK_ENABLE(); return; }
#endif
#if defined(TIM12_EXISTS)
    if (TIMx == TIM12) { __HAL_RCC_TIM12_CLK_ENABLE(); return; }
#endif
#if defined(TIM13_EXISTS)
    if (TIMx == TIM13) { __HAL_RCC_TIM13_CLK_ENABLE(); return; }
#endif
#if defined(TIM14_EXISTS)
    if (TIMx == TIM14) { __HAL_RCC_TIM14_CLK_ENABLE(); return; }
#endif
#if defined(TIM15_EXISTS)
    if (TIMx == TIM15) { __HAL_RCC_TIM15_CLK_ENABLE(); return; }
#endif
#if defined(TIM16_EXISTS)
    if (TIMx == TIM16) { __HAL_RCC_TIM16_CLK_ENABLE(); return; }
#endif
#if defined(TIM17_EXISTS)
    if (TIMx == TIM17) { __HAL_RCC_TIM17_CLK_ENABLE(); return; }
#endif
    // clang-format on
    ( void )TIMx;
}

// ============================================================================
// to be extended
#if defined(UART_EXISTS)
static void enableUartClock(USART_TypeDef* USARTx) {
    // clang-format off
#if defined(USART1_EXISTS)
    if (USARTx == USART1) { __HAL_RCC_USART1_CLK_ENABLE(); return; }
#endif
#if defined(USART2_EXISTS)
#if defined(STM32F746xx) || defined(STM32F767xx)
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct2 = { 0 };
    PeriphClkInitStruct2.PeriphClockSelection = RCC_PERIPHCLK_USART2;
    PeriphClkInitStruct2.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct2) != HAL_OK) {
        Error_Handler(HSE_VALUE * 5);
    }
#endif // STM32F746xx || STM32F767xx
    if (USARTx == USART2) { __HAL_RCC_USART2_CLK_ENABLE(); return; }
#endif
#if defined(USART3_EXISTS)
#if defined(STM32F746xx) || defined(STM32F767xx)
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct3 = { 0 };
    PeriphClkInitStruct3.PeriphClockSelection = RCC_PERIPHCLK_USART3;
    PeriphClkInitStruct3.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct3) != HAL_OK) {
        Error_Handler(HSE_VALUE * 5);
    }
#endif // STM32F746xx || STM32F767xx
    if (USARTx == USART3) { __HAL_RCC_USART3_CLK_ENABLE(); return; }
#endif
#if defined(UART4_EXISTS)
    if (USARTx == UART4) { __HAL_RCC_UART4_CLK_ENABLE(); return; }
#endif
#if defined(UART5_EXISTS)
    if (USARTx == UART5) { __HAL_RCC_UART5_CLK_ENABLE(); return; }
#endif
#if defined(USART6_EXISTS)
    if (USARTx == USART6) { __HAL_RCC_USART6_CLK_ENABLE(); return; }
#endif
#if defined(UART7_EXISTS)
    if (USARTx == UART7) { __HAL_RCC_UART7_CLK_ENABLE(); return; }
#endif
#if defined(UART8_EXISTS)
    if (USARTx == UART8) { __HAL_RCC_UART8_CLK_ENABLE(); return; }
#endif
    // clang-format on
    ( void )USARTx;
}
#endif  // UART_EXISTS

// ============================================================================
#if defined(SPI_EXISTS)
static void enableSpiClock(SPI_TypeDef* SPIx) {
    // clang-format off
#if defined(SPI1_EXISTS)
    if (SPIx == SPI1) { __HAL_RCC_SPI1_CLK_ENABLE(); return; }
#endif
#if defined(SPI2_EXISTS)
    if (SPIx == SPI2) { __HAL_RCC_SPI2_CLK_ENABLE(); return; }
#endif
#if defined(SPI3_EXISTS)
    if (SPIx == SPI3) { __HAL_RCC_SPI3_CLK_ENABLE(); return; }
#endif
#if defined(SPI4_EXISTS)
    if (SPIx == SPI4) { __HAL_RCC_SPI4_CLK_ENABLE(); return; }
#endif
#if defined(SPI5_EXISTS)
    if (SPIx == SPI5) { __HAL_RCC_SPI5_CLK_ENABLE(); return; }
#endif
#if defined(SPI6_EXISTS)
    if (SPIx == SPI6) { __HAL_RCC_SPI6_CLK_ENABLE(); return; }
#endif
    // clang-format on
    ( void )SPIx;
}
#endif  // SPI_EXISTS

// ============================================================================
// good for GPIO_MODE_INPUT (not GPIO_Mode_IPU??), GPIO_MODE_OUTPUT_PP
static void setPinMode(GPIO_TypeDef* GPIOx, uint8_t pin_n, uint32_t mode) {
    assert_param(IS_GPIO_MODE(mode));
    uint16_t GPIO_PIN_x = 1 << pin_n;

// #if defined(STM32F107xC )  // || ( defined STM32F10Xxxxx)
// PB3/PB4 and PA15 is used as JTDO/TRACESWO after reset,
// therefore we must first disable JTAG and async trace functions to
// release PB3/PB4 for GPIO use this operation is confirmed on STM32F1
// micro controllers

